var Color = {
	safeNames: 'черный темно-бордовый зеленый темно-синий оливковый фиолетовый зеленовато-голубой синий серебро серый желтый фуксия цвет морской волны белый'.split(" "),

	names: 'Военно-воздушный синий
	Синий Элис|Рузвельт Лонгворт
	Ализариновый красный
	Миндаль Крайола
	Амарантовый
	Янтарный
	Американская роза
	Аметистовый
	Матовый белый
	Античный белый
	Яблочно-зелёный
	Спаржа
	Цвет морской волны
	Аквамариновый
	Армейский зелёный
	Мышьяковый
	Лазурный|Азур
	Голубовато-серый цвет
	Беж|бежевый
	Бистр
	Горькая радость
	Чёрный
	Белокурый
	Синий
	Вода пляжа Бонди
	Красный Университета Бостона
	Латунный
	Ярко-зелёный
	Ярко-бирюзовый
	Ярко-фиолетовый
	Бронзовый
	Коричневый
	Кожа буйвола|палевый
	Бургундский
	Выгоревший оранжевый
	Сиена жжёная
	Коричневый|умбра жжёная
	Хаки
	Тёмно-красный|кардинал
	Карминово-красный
	Морковный
	Селадоновый
	Светлая вишня
	Лазурный
	Лазурно-синий
	Салатовый цвет|шартрез
	Каштановый
	Шоколадный
	Коричный
	Кобальт синий
	Медный
	Коралловый|кораллово-красный
	Кукурузный
	Васильковый
	Кремовый
	Тёмно-красный|кровавый|кармазин
	Циан|васильковый
	Тёмно-синий цвет
	Тёмно-коричневый
	Тёмно-лазурный
	Тёмно-каштановый
	Тёмно-коралловый
	Тёмно-золотой
	Тёмно-зелёный
	Тёмный индиго|индиго
	Тёмный хаки|хаки
	Тёмно-оливковый
	Тёмный пастельно-зелёный
	Тёмно-персиковый
	Тёмно-розовый
	Тёмная лососина
	Тёмно-алый
	Тёмно-аспидный серый|аспидно-серый
	Тёмный весенне-зелёный
	Тёмный жёлто-коричневый
	Тёмно-мандариновый
	Тёмный зелёный чай
	Тёмно-бирюзовый
	Глубокий фиолетовый цвет
	Глубокий розовый цвет
	Голубой цвет
	Джинсовый синий
	Защитно-синий
	Изумрудный
	Баклажановый
	Зелёный папоротник
	Кирпичный
	Льняной
	Фуксия
	Гуммигут
	Золотой
	Золотисто-берёзовый
	Серый
	Серая спаржа
	Зелёный серый чай
	Зелёный
	Жёлто-зелёный
	Синий Градуса
	Гелиотроп
	Ярко-розовый цвет
	Индиго
	Международный (сигнальный) оранжевый
	Индийский красный|каштановый
	Нефритовый
	Хаки
	Синий Клейна
	Лаванда|лавандово-синий
	Розово-лавандовый
	Лимонный
	Лимонно-кремовый
	Светло-коричневый
	Сиреневый
	Лайм
	Льняной
	Зелёная лужайка
	Малиновый|фуксия
	Малахитовая зелень (малахитовый)
	Коричнево-малиновый
	Розовато-лиловый
	Полуночно-синий
	Зелёная мята (мятный)
	Зелёный мох
	Розовый Маунтбэттена
	Горчичный
	Белый навахо
	Тёмно-синий|цвет формы морских офицеров
	Охра
	Старое золото
	Оливковый
	Нежно-оливковый
	Оранжевый
	Орхидея
	Старое кружево
	Бледно-синий
	Бледно-коричневый
	Бледно-карминный|ср. Кармин
	Бледно-каштановый
	Бледно-васильковый
	Бледно-пурпурный
	Бледный розовато-лиловый
	Бледно-розовый
	Лиловый
	Бледно-песочный цвет
	Палевый
	Панг
	Побег папайи
	Пастельно-зелёный
	Пастельно-розовый
	Персиковый
	Оранжево-персиковый
	Жёлто-персиковый
	Грушевый
	Барвинок
	Персидский синий
	Зелёная сосна
	Розовый
	Оранжево-розовый
	Сливовый
	Пороховая синь
	Красновато-коричневый|пюсовый (устар.)|тёмно-коричневый|блошиный
	Берлинская лазурь
	Тыква
	Фиолетовый (оттенок)
	Умбра
	Красный
	Фиолетово-красный
	Цвет яйца дрозда
	Ярко-синий («королевский синий»)
	Красновато-коричневый
	Ржаво-коричневый
	Розово-коричневый
	Blaze Orange)	Сигнальный оранжевый
	Шафрановый
	Сапфировый
	Лососёвый
	Песочный цвет
	Сангрия
	Ярко-красный|алый
	Цвет жёлтого школьного автобуса
	Зелёное море
	Цвет морской пены
	Отборный жёлтый
	Сепия
	Серебряный
	Серый шифер
	Зелёная весна
	Синяя сталь
	Болотный
	Цвет загара
	Краснобуро-оранжевый
	Мандариновый
	Зелёный чай
	Сине-зелёный
	Чертополох
	Бирюзовый|ср. бирюза
	Тициановый
	Транспортный красный
	Томатный
	Ультрамариновый
	Цвет флага ООН
	Ванильный
	Киноварь|ср. киноварь (минерал)
	Фиолетовый
	Фиолетово-баклажанный
	Ядовито-зелёный
	Пшеничный
	Белый
	Глициния
	Вино
	Жёлтый
	Циннвальдит
	Кобальтовая синь'.split('\n')
}